1、chomod权限管理

作用：改变文件或者目录权限

使用方法：chmod 所有者/所属组/其他人 添加/删除/赋予 可读/可写/可执行 对某个文件

所有者：u
所属组：g
其他人：o

添加：+
删除：-
可执行：=

可读可写可执行：rwx

比如对文件添加执行权限 chmod u+x a

或者使用数字直接赋予权限，我们知道一个文件的权限包含 所有者所属组其他人，因此一共有三组
比如 rwxrwxrwx，用数字表示为777，对应关系为r=4 w=2 x=1

比如对文件b赋予所有权限 chmod 777 b

2、chown改变文件或者目录的所有者
chown oneuser 1  -->将文件1的所有者改为oneuser,这个所有者在系统中必须已经存在

3、chgrp改变所属组
chgrp onegroup 1 -->强文件1的所属组改为onegroup

4、umask 改变默认权限
用简单的方式显示可以指定-S, umask -S
不指定显示方式的时候会出现类似0022的方式，
0位特殊权限
022是用户权限掩码，实际的权限可以用777-022=755就是真正的所有的权限。

linux缺省默认创建的文件是没有可执行权限的。所以一般创建的文件拥有的权限为644
